Revit 2027 API
ParameterFailures Properties
The BuiltInFailures.ParameterFailures type exposes the following members.
Properties
Name | Description
InconsistentSharedParameterDefinitions |  The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.
UnrecognizedSharedParameterDataType |  The shared parameter '...' with name '...' cannot be added because its data type is not recognized.
Top
See Also
Reference
BuiltInFailures.ParameterFailures Class
Autodesk.Revit.DB Namespace